IRP/src/AccumulationRegisters/PartnerApTransactions/PartnerApTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>PartnerApTransactions</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BasisDocument</name>
    <type>
      <types>DefinedType.typeApTransactionBasises</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/PartnerArTransactions/PartnerArTransactions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>PartnerArTransactions</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BasisDocument</name>
    <type>
      <types>DefinedType.typeArTransactionBasises</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Enums/ApArPostingDetail/ApArPostingDetail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ApArPostingDetail</name>
 <enumValues>
  <name>ByDocuments</name>
 </enumValues>
 <enumValues>
  <name>ByAgreements</name>
 </enumValues>
 <enumValues>
  <name>ByStandardAgreement</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/OutgoingPaymentTransactionTypes/OutgoingPaymentTransactionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>OutgoingPaymentTransactionTypes</name>
 <enumValues>
  <name>PaymentToVendor</name>
 </enumValues>
 <enumValues>
  <name>CurrencyExchange</name>
 </enumValues>
 <enumValues>
  <name>CashTransferOrder</name>
 </enumValues>
 <enumValues>
  <name>ReturnToCustomer</name>
 </enumValues>
 <enumValues>
  <name>ReturnToCustomerByPOS</name>
 </enumValues>
 <enumValues>
  <name>PaymentByCheque</name>
 </enumValues>
 <enumValues>
  <name>RetailCustomerAdvance</name>
 </enumValues>
 <enumValues>
  <name>EmployeeCashAdvance</name>
 </enumValues>
 <enumValues>
  <name>SalaryPayment</name>
 </enumValues>
 <enumValues>
  <name>OtherExpense</name>
 </enumValues>
 <enumValues>
  <name>OtherPartner</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/AgreementKinds/AgreementKinds.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementKinds</name>
 <enumValues>
  <name>Regular</name>
 </enumValues>
 <enumValues>
  <name>Standard</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/AgreementTypes/AgreementTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AgreementTypes</name>
 <enumValues>
  <name>Customer</name>
 </enumValues>
 <enumValues>
  <name>Vendor</name>
 </enumValues>
 <enumValues>
  <name>Consignor</name>
 </enumValues>
 <enumValues>
  <name>TradeAgent</name>
 </enumValues>
 <enumValues>
  <name>Other</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/IncomingPaymentTransactionType/IncomingPaymentTransactionType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>IncomingPaymentTransactionType</name>
 <enumValues>
  <name>PaymentFromCustomer</name>
 </enumValues>
 <enumValues>
  <name>CurrencyExchange</name>
 </enumValues>
 <enumValues>
  <name>CashTransferOrder</name>
 </enumValues>
 <enumValues>
  <name>TransferFromPOS</name>
 </enumValues>
 <enumValues>
  <name>ReturnFromVendor</name>
 </enumValues>
 <enumValues>
  <name>PaymentFromCustomerByPOS</name>
 </enumValues>
 <enumValues>
  <name>ReceiptByCheque</name>
 </enumValues>
 <enumValues>
  <name>CashIn</name>
 </enumValues>
 <enumValues>
  <name>RetailCustomerAdvance</name>
 </enumValues>
 <enumValues>
  <name>EmployeeCashAdvance</name>
 </enumValues>
 <enumValues>
  <name>OtherIncome</name>
 </enumValues>
 <enumValues>
  <name>OtherPartner</name>
 </enumValues>
 <enumValues>
  <name>SalaryReturn</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Agreements/Agreements.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Agreements</name>
 <attributes>
  <name>Number</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>30</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Date</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PartnerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemSegment</name>
  <type>
   <types>CatalogRef.ItemSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>StartUsing</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndOfUse</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DaysBeforeDelivery</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>2</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.AgreementTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>ApArPostingDetail</name>
  <type>
   <types>EnumRef.ApArPostingDetail</types>
  </type>
 </attributes>
 <attributes>
  <name>StandardAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Kind</name>
  <type>
   <types>EnumRef.AgreementKinds</types>
  </type>
 </attributes>
 <attributes>
  <name>UseCreditLimit</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CreditLimitAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>PaymentTerm</name>
  <type>
   <types>CatalogRef.PaymentSchedules</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeType</name>
  <type>
   <types>EnumRef.TradeAgentFeeTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeePercent</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeExpenseRevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>RecordPurchasePrices</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Account</name>
  <type>
   <types>CatalogRef.PartnersBankAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>UseOrdersForSettlements</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/ChartsOfCharacteristicTypes/CurrencyMovementType/CurrencyMovementType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
 <name>CurrencyMovementType</name>
 <type>
  <types>EnumRef.CurrencyType</types>
 </type>
 <predefined>
  <items>
   <name>SettlementCurrency</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_PartnerTerm</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_Legal</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
 </predefined>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Source</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CurrencyType</types>
  </type>
 </attributes>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NotPostIfRateNotSet</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>EverydayRates</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/CommonModules/DocumentsGenerationServer/Module.bsl
#Region ExtractDataFormBasisesDocuments

Function GetQueryFilters(AccReg, ArrayOfBasisDocuments)
	Filter_ByDocuments = New ValueTable();
	Filter_ByDocuments.Columns.Add("BasisDocument" , New TypeDescription(AccReg.Dimensions.BasisDocument.Type));
	
	Filter_ByAgreements = New ValueTable();
	Filter_ByAgreements.Columns.Add("Company", New TypeDescription(AccReg.Dimensions.Company.Type));
	Filter_ByAgreements.Columns.Add("Currency", New TypeDescription(AccReg.Dimensions.Currency.Type));
	Filter_ByAgreements.Columns.Add("Agreement", New TypeDescription(AccReg.Dimensions.Agreement.Type));
	Filter_ByAgreements.Columns.Add("Partner", New TypeDescription(AccReg.Dimensions.Partner.Type));
	Filter_ByAgreements.Columns.Add("LegalName", New TypeDescription(AccReg.Dimensions.LegalName.Type));
	
	Filter_ByStandardAgreement = New ValueTable();
	Filter_ByStandardAgreement.Columns.Add("Company", New TypeDescription(AccReg.Dimensions.Company.Type));
	Filter_ByStandardAgreement.Columns.Add("Currency", New TypeDescription(AccReg.Dimensions.Currency.Type));
	Filter_ByStandardAgreement.Columns.Add("Agreement", New TypeDescription(AccReg.Dimensions.Agreement.Type));
	Filter_ByStandardAgreement.Columns.Add("Partner", New TypeDescription(AccReg.Dimensions.Partner.Type));
	Filter_ByStandardAgreement.Columns.Add("LegalName", New TypeDescription(AccReg.Dimensions.LegalName.Type));
	
	For Each BasisDocument In ArrayOfBasisDocuments Do
		InvoiceData = New Structure();
		
		InvoiceData.Insert("Company", BasisDocument.Company);
		InvoiceData.Insert("Currency", BasisDocument.Currency);
		InvoiceData.Insert("Partner", BasisDocument.Partner);
		InvoiceData.Insert("LegalName", BasisDocument.LegalName);
		
		NewRow = Undefined;
		If ValueIsFilled(BasisDocument.Agreement) Then
			If BasisDocument.Agreement.ApArPostingDetail = Enums.ApArPostingDetail.ByDocuments Then
				InvoiceData.Insert("BasisDocument", BasisDocument);
				NewRow = Filter_ByDocuments.Add();
			ElsIf BasisDocument.Agreement.ApArPostingDetail = Enums.ApArPostingDetail.ByAgreements Then
				InvoiceData.Insert("Agreement", BasisDocument.Agreement);
				NewRow = Filter_ByAgreements.Add();
			ElsIf BasisDocument.Agreement.ApArPostingDetail = Enums.ApArPostingDetail.ByStandardAgreement Then
				InvoiceData.Insert("Agreement", BasisDocument.Agreement.StandardAgreement);
				NewRow = Filter_ByStandardAgreement.Add();
			EndIf;
			FillPropertyValues(NewRow, InvoiceData);
		EndIf;
	EndDo;
	
	Result = New Structure();
	Result.Insert("Filter_ByDocuments", Filter_ByDocuments);
	Result.Insert("Filter_ByAgreements", Filter_ByAgreements);
	Result.Insert("Filter_ByStandardAgreement", Filter_ByStandardAgreement);
	Return Result;
EndFunction

Procedure PutQueryFiltersToTempTables(TempTableManager, Filters)
	Query = New Query();
	Query.TempTablesManager = TempTableManager;
	Query.Text =
		"SELECT
		|	tmp.BasisDocument AS BasisDocument
		|INTO Filter_ByDocuments
		|FROM
		|	&Filter_ByDocuments AS tmp
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	tmp.Company AS Company,
		|	tmp.Currency AS Currency,
		|	tmp.Agreement AS Agreement,
		|	tmp.Partner AS Partner,
		|	tmp.LegalName
		|INTO Filter_ByAgreements
		|FROM
		|	&Filter_ByAgreements AS tmp
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	tmp.Company AS Company,
		|	tmp.Currency AS Currency,
		|	tmp.Agreement AS Agreement,
		|	tmp.Partner AS Partner,
		|	tmp.LegalName
		|INTO Filter_ByStandardAgreement
		|FROM
		|	&Filter_ByStandardAgreement AS tmp";
	// put value tables to temp tables
	Query.SetParameter("Filter_ByDocuments", Filters.Filter_ByDocuments);
	Query.SetParameter("Filter_ByAgreements", Filters.Filter_ByAgreements);
	Query.SetParameter("Filter_ByStandardAgreement", Filters.Filter_ByStandardAgreement);
	Query.Execute();
EndProcedure	

Function GetDocumentTable_PurchaseInvoice_ForPayment(ArrayOfBasisDocuments, AddInfo = Undefined) Export

	Filters = GetQueryFilters(Metadata.AccumulationRegisters.PartnerApTransactions, ArrayOfBasisDocuments);
	
	TempTableManager = New TempTablesManager();
	PutQueryFiltersToTempTables(TempTableManager, Filters);
	
	Query = New Query();
	Query.TempTablesManager = TempTableManager;
	Query.Text = 
		"SELECT
		|	""PurchaseInvoice"" AS BasedOn,
		|	VALUE(Enum.OutgoingPaymentTransactionTypes.PaymentToVendor) AS TransactionType,
		|	PartnerTransactionsBalance.Company AS Company,
		|	PartnerTransactionsBalance.Currency AS Currency,
		|	PartnerTransactionsBalance.Partner AS Partner,
		|	PartnerTransactionsBalance.Agreement AS StandardAgreement,
		|	VALUE(Catalog.Agreements.EmptyRef) AS Agreement,
		|	PartnerTransactionsBalance.LegalName AS LegalName,
		|	PartnerTransactionsBalance.AmountBalance AS Amount
		|FROM
		|	AccumulationRegister.PartnerApTransactions.Balance(, (Company, Currency, Agreement, Partner, LegalName) IN
		|		(SELECT
		|			tmp.Company,
		|			tmp.Currency,
		|			tmp.Agreement,
		|			tmp.Partner,
		|			tmp.LegalName
		|		FROM
		|			Filter_ByStandardAgreement AS tmp)
		|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
		|		PartnerTransactionsBalance
		|WHERE
		|	PartnerTransactionsBalance.AmountBalance > 0";
	
	// get default agreement by partner for standard agreement
	QueryResult = Query.Execute();
	QueryTable_StandardAgreements = QueryResult.Unload();
	For Each Row In QueryTable_StandardAgreements Do
		AgreementParameters = New Structure();
		AgreementParameters.Insert("Partner"		, Row.Partner);
		AgreementParameters.Insert("Agreement"		, Catalogs.Agreements.EmptyRef());
		AgreementParameters.Insert("ArrayOfFilters"	, New Array());
		AgreementParameters.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, ComparisonType.NotEqual));
		AgreementParameters.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("StandardAgreement", Row.StandardAgreement, ComparisonType.Equal));
		AgreementParameters.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Kind", Enums.AgreementKinds.Regular, ComparisonType.Equal));
		AgreementParameters.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Type", Enums.AgreementTypes.Vendor, ComparisonType.Equal));
		Row.Agreement = DocumentsServer.GetAgreementByPartner(AgreementParameters);
	EndDo;
	
	Query.Text = 
		"SELECT
		|	tmp.BasedOn,
		|	tmp.TransactionType AS TransactionType,
		|	tmp.Company AS Company,
		|	tmp.Currency AS Currency,
		|	tmp.Partner AS Partner,
		|	tmp.Agreement AS Agreement,
		|	tmp.LegalName AS LegalName,
		|	tmp.Amount AS Amount
		|INTO QueryTable_StandardAgreements
		|FROM
		|	&QueryTable_StandardAgreements AS tmp
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	""PurchaseInvoice"" AS BasedOn,
		|	VALUE(Enum.OutgoingPaymentTransactionTypes.PaymentToVendor) AS TransactionType,
		|	PartnerTransactionsBalance.Company,
		|	PartnerTransactionsBalance.Currency,
		|	PartnerTransactionsBalance.BasisDocument,
		|	PartnerTransactionsBalance.Partner,
		|	PartnerTransactionsBalance.Agreement,
		|	PartnerTransactionsBalance.LegalName AS Payee,
		|	PartnerTransactionsBalance.AmountBalance AS Amount
		|FROM
		|	AccumulationRegister.PartnerApTransactions.Balance(, BasisDocument IN
		|		(SELECT
		|			tmp.BasisDocument
		|		FROM
		|			Filter_ByDocuments AS tmp)
		|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
		|		PartnerTransactionsBalance
		|WHERE
		|	PartnerTransactionsBalance.AmountBalance > 0
		|
		|UNION ALL
		|
		|SELECT
		|	""PurchaseInvoice"",
		|	VALUE(Enum.OutgoingPaymentTransactionTypes.PaymentToVendor),
		|	PartnerTransactionsBalance.Company,
		|	PartnerTransactionsBalance.Currency,
		|	UNDEFINED,
		|	PartnerTransactionsBalance.Partner,
		|	PartnerTransactionsBalance.Agreement,
		|	PartnerTransactionsBalance.LegalName,
		|	PartnerTransactionsBalance.AmountBalance
		|FROM
		|	AccumulationRegister.PartnerApTransactions.Balance(, (Company, Currency, Agreement, Partner, LegalName) IN
		|		(SELECT
		|			tmp.Company,
		|			tmp.Currency,
		|			tmp.Agreement,
		|			tmp.Partner,
		|			tmp.LegalName
		|		FROM
		|			Filter_ByAgreements AS tmp)
		|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
		|		PartnerTransactionsBalance
		|WHERE
		|	PartnerTransactionsBalance.AmountBalance > 0
		|
		|UNION ALL
		|
		|SELECT
		|	QueryTable_StandardAgreements.BasedOn,
		|	QueryTable_StandardAgreements.TransactionType,
		|	QueryTable_StandardAgreements.Company,
		|	QueryTable_StandardAgreements.Currency,
		|	UNDEFINED,
		|	QueryTable_StandardAgreements.Partner,
		|	QueryTable_StandardAgreements.Agreement,
		|	QueryTable_StandardAgreements.LegalName,
		|	QueryTable_StandardAgreements.Amount
		|FROM
		|	QueryTable_StandardAgreements AS QueryTable_StandardAgreements";
		
	Query.SetParameter("QueryTable_StandardAgreements", QueryTable_StandardAgreements);
	QueryResult = Query.Execute();
	Return QueryResult.Unload();
EndFunction

Function GetDocumentTable_SalesInvoice_ForReceipt(ArrayOfBasisDocuments, AddInfo = Undefined) Export
	
	Filters = GetQueryFilters(Metadata.AccumulationRegisters.PartnerArTransactions, ArrayOfBasisDocuments);
	
	TempTableManager = New TempTablesManager();
	PutQueryFiltersToTempTables(TempTableManager, Filters);
	
	Query = New Query();
	Query.TempTablesManager = TempTableManager;
	Query.Text = 
		"SELECT
		|	""SalesInvoice"" AS BasedOn,
		|	VALUE(Enum.IncomingPaymentTransactionType.PaymentFromCustomer) AS TransactionType,
		|	PartnerTransactionsBalance.Company AS Company,
		|	PartnerTransactionsBalance.Currency AS Currency,
		|	PartnerTransactionsBalance.Partner AS Partner,
		|	PartnerTransactionsBalance.Agreement AS StandardAgreement,
		|	VALUE(Catalog.Agreements.EmptyRef) AS Agreement,
		|	PartnerTransactionsBalance.LegalName AS LegalName,
		|	PartnerTransactionsBalance.AmountBalance AS Amount
		|FROM
		|	AccumulationRegister.PartnerArTransactions.Balance(, (Company, Currency, Agreement, Partner, LegalName) IN
		|		(SELECT
		|			tmp.Company,
		|			tmp.Currency,
		|			tmp.Agreement,
		|			tmp.Partner,
		|			tmp.LegalName
		|		FROM
		|			Filter_ByStandardAgreement AS tmp)
		|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
		|		PartnerTransactionsBalance
		|WHERE
		|	PartnerTransactionsBalance.AmountBalance > 0";
	
	// get default agreement by partner for standard agreement
	QueryResult = Query.Execute();
	QueryTable_StandardAgreements = QueryResult.Unload();
	For Each Row In QueryTable_StandardAgreements Do
		AgreementParameters = New Structure();
		AgreementParameters.Insert("Partner"		, Row.Partner);
		AgreementParameters.Insert("Agreement"		, Catalogs.Agreements.EmptyRef());
		AgreementParameters.Insert("ArrayOfFilters"	, New Array());
		AgreementParameters.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("DeletionMark", True, ComparisonType.NotEqual));
		AgreementParameters.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("StandardAgreement", Row.StandardAgreement, ComparisonType.Equal));
		AgreementParameters.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Kind", Enums.AgreementKinds.Regular, ComparisonType.Equal));
		AgreementParameters.ArrayOfFilters.Add(DocumentsClientServer.CreateFilterItem("Type", Enums.AgreementTypes.Customer, ComparisonType.Equal));
		
		Row.Agreement = DocumentsServer.GetAgreementByPartner(AgreementParameters);
	EndDo;
	
	Query.Text = 
		"SELECT
		|	tmp.BasedOn,
		|	tmp.TransactionType AS TransactionType,
		|	tmp.Company AS Company,
		|	tmp.Currency AS Currency,
		|	tmp.Partner AS Partner,
		|	tmp.Agreement AS Agreement,
		|	tmp.LegalName AS LegalName,
		|	tmp.Amount AS Amount
		|INTO QueryTable_StandardAgreements
		|FROM
		|	&QueryTable_StandardAgreements AS tmp
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	""SalesInvoice"" AS BasedOn,
		|	VALUE(Enum.IncomingPaymentTransactionType.PaymentFromCustomer) AS TransactionType,
		|	PartnerTransactionsBalance.Company,
		|	PartnerTransactionsBalance.Currency,
		|	PartnerTransactionsBalance.BasisDocument,
		|	PartnerTransactionsBalance.Partner,
		|	PartnerTransactionsBalance.Agreement,
		|	PartnerTransactionsBalance.LegalName AS Payer,
		|	PartnerTransactionsBalance.AmountBalance AS Amount
		|FROM
		|	AccumulationRegister.PartnerArTransactions.Balance(, BasisDocument IN
		|		(SELECT
		|			tmp.BasisDocument
		|		FROM
		|			Filter_ByDocuments AS tmp)
		|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
		|		PartnerTransactionsBalance
		|WHERE
		|	PartnerTransactionsBalance.AmountBalance > 0
		|
		|UNION ALL
		|
		|SELECT
		|	""SalesInvoice"",
		|	VALUE(Enum.IncomingPaymentTransactionType.PaymentFromCustomer),
		|	PartnerTransactionsBalance.Company,
		|	PartnerTransactionsBalance.Currency,
		|	UNDEFINED,
		|	PartnerTransactionsBalance.Partner,
		|	PartnerTransactionsBalance.Agreement,
		|	PartnerTransactionsBalance.LegalName,
		|	PartnerTransactionsBalance.AmountBalance
		|FROM
		|	AccumulationRegister.PartnerArTransactions.Balance(, (Company, Currency, Agreement, Partner, LegalName) IN
		|		(SELECT
		|			tmp.Company,
		|			tmp.Currency,
		|			tmp.Agreement,
		|			tmp.Partner,
		|			tmp.LegalName
		|		FROM
		|			Filter_ByAgreements AS tmp)
		|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
		|		PartnerTransactionsBalance
		|WHERE
		|	PartnerTransactionsBalance.AmountBalance > 0
		|
		|UNION ALL
		|
		|SELECT
		|	QueryTable_StandardAgreements.BasedOn,
		|	QueryTable_StandardAgreements.TransactionType,
		|	QueryTable_StandardAgreements.Company,
		|	QueryTable_StandardAgreements.Currency,
		|	UNDEFINED,
		|	QueryTable_StandardAgreements.Partner,
		|	QueryTable_StandardAgreements.Agreement,
		|	QueryTable_StandardAgreements.LegalName,
		|	QueryTable_StandardAgreements.Amount
		|FROM
		|	QueryTable_StandardAgreements AS QueryTable_StandardAgreements";
		
	Query.SetParameter("QueryTable_StandardAgreements", QueryTable_StandardAgreements);
	QueryResult = Query.Execute();
	Return QueryResult.Unload();
EndFunction

#EndRegion
